app/controllers/customers_controller.rb

INSERT INTO "customers" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)
---
  def create
    @customer = Customer.new(customer_params)
    if @customer.save