app/controllers/sessions_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."email" = ? LIMIT ?  [["email", ""], ["LIMIT", 1]]
---
  def create
      @customer = Customer.find_by(email: params[:session][:email].downcase)